"""Profile meeting status"""
waiting_status_constant = 1 #1 waiting
meeting_status_constant = 2 #2 meeting
not_ready_status_constant = 0 #0 not ready

"""Text button"""
change_profile = 'изменить профиль'
change_meeting_status = 'изменить статус поиска'

"""Text message"""
share_your_interests = """📝Теперь поделись своими интересами.
Таким образом собеседники могут лучше узнать друг о друге еще до встречи.

🌕Совпадающие интересы помогут быстро найти общие темы для общения.
🌗Но и различные интересы  часто дарят  множество  открытий для собеседников.

👉После того, как ты поставишь минимум один интерес, вызови команду /profile, чтобы увидеть свой профиль. 
В нем же ты всегда можешь изменить статус и перейти к поиску собеседника.🧾"""
if_you_have_questions_use_help="""Если у тебя есть вопросы, используй команду /help, выбери нужный из списка или задай свой.
Команда BeNearly постарается ответить на твои вопросы как можно скорее🤹‍♂️🧙‍♂️🧙‍♀️"""
see_you_in_week = f"Хорошо, тогда увидимся через неделю :) Но если тебе захочется найти собеседника, ты легко можешь изменить свой статус в профиле  с помощью команды /profile До встречи!"
find_companion_on_Monday = f"Мы постараемся найти тебе собеседника в понедельник. До встречи!👀"
error_contact_support = f"Возникла ошибка, обратись в поддержку"
want_find_another_companion = "Отлично! Хочешь, мы начнем искать тебе нового собеседника?🌛"
thank_you_for_feedback_see_you_on_Sunday= "Спасибо, мы записали твою оценку. До встречи в воскресенье!💫"
see_you_on_Sunday='Тогда, надеюсь, увидимся в воскресенье, когда мы начинаем неделю новых встреч. Мы напишем тебе📬'





"""Menu"""
first_meet = """💡Подсказки для твоей первой встречи
📆1) Когда ты получил собеседника, не стесняйся написать первым, сделать первый шаг навстречу - красивый и смелый жест.
Начать можно так: Привет, бот BeNearly написал, что ты мой собеседник на этой неделе. Рад(а) познакомиться :)

📭2)Что делать, если собеседник не отвечает?
Такое случается, не унывай.
Просто попробуй напомнить о себе в чате
Например, вот так: Привет, что насчет нашей встречи? У тебя получится пообщаться на этой неделе?
Но если собеседник по-прежнему не отвечает, то расскажи нам об этом в среду. Мы обязательно попытаемся найти тебе  нового собеседника, не переживай.🙌

⏳3)И, конечно же, старайся не игнорировать собеседника, лучше напиши сразу, если не получится пообщаться.

🔮4)Ну а мы готовы ответить в любое время под звездами. Просто воспользуйся командой /help."""

how_bot_work ="""☯️Сейчас мы проводим встречи в двух разных форматах: недельные и 10-минутные встречи.

📆Недельные встречи: в начале недели мы подбираем тебе собеседника. В этом формате подбор осуществляется на основе интересов и целей, которые  пользователь указал в личном профиле.

По средам и субботам мы просим собеседников оценить, как прошла встреча. Это нужно для того, чтобы в дальнейшем формировать репутацию пользователей, что позволит тебе избегать неадекватных собеседников.🤹‍♂️

⏳10-минутные встречи:
Не раздумывая и не отвлекаясь на предрассудки,  случайных собеседников  просто подбрасывает  прямо в море - бух.

 Во время встречи  ты останешься наедине с собеседником в тайном чате,  у тебя будет возможность обменятся контактами, если  собеседник тебя зацепил, или  в любой момент покинуть встречу, не дожидаясь  окончания 10 минут.🎬"""

write_your_question = """⬇️⬇️⬇️Вводи свой вопрос прям сюда⬇️⬇️⬇️"""