"""Bot's url"""
questions_bot_url = 't.me/BeHelpy_bot'
fast_meet_bot_url = 't.me/BeNearly_FastMeet_bot'

"""Profile meeting status"""
waiting_status_constant = 1 #1 waiting
meeting_status_constant = 2 #2 meeting
not_ready_status_constant = 0 #0 not ready

"""Text button"""
change_profile = 'изменить профиль'
change_meeting_status = 'изменить статус поиска'
change_meeting_status_for_new_profile = """Теперь дело за BeNearly🧙‍♂️

Как только найдется свободный собеседник, мы сразу представим вас друг другу.

До встречи!👀"""


"""Text message"""
blank_email = """Один из компонентов нашей магии✨ - это почта, которая поможет создать твой личный профиль.

Не волнуйся, BeNearly🧙‍♂️ не любит спам и обещает не присылать его тебе.

Напиши свой почтовый ящик, чтобы скорее пройти регистрацию💌"""

blank_profile = """⬜️Сейчас твой профиль - это пустой белый холст. 

Первым делом расскажи о себе и своих интересах.

После этого мы создадим карточку профиля, которая будет приходить твоему собеседнику перед встречей📥"""

error_contact_support = f"Возникла ошибка, обратись в поддержку"
fast_meet_message="🧙‍♀️ В тот же миг Алиса юркнула за ним следом, не думая о том, как же она будет выбираться обратно."
find_companion_on_Monday = f"Мы постараемся найти тебе собеседника в понедельник. До встречи!👀"
invalid_email = """Не совсем похоже на почту🧙‍♂️

Попробуй еще раз, чтобы скорее пройти регистрацию💌"""

if_you_have_questions_use_help="""Если у тебя есть вопросы, используй команду /help, выбери нужный из списка или задай свой.
Команда BeNearly постарается ответить на твои вопросы как можно скорее🤹‍♂️🧙‍♂️🧙‍♀️"""
impossible_to_leave_feedback = """👁‍🗨Что-то случилось на нашей стороне, поэтому ты временно не сможешь оставить оценку. 

Всегда что-то может пойти не так, мы извиняемся за это😞

Если тебе не сложно, ты можешь отправить нам скриншот этой ошибки:
 /help ⟶ Задать свой вопрос"""
share_your_interests = """📝Теперь поделись своими интересами.
Таким образом собеседники могут лучше узнать друг о друге еще до встречи.

🌕Совпадающие интересы помогут быстро найти общие темы для общения.

🌗Но и различные интересы  часто дарят  множество  открытий для собеседников.

Когда сохранишь свои интересы, вызови команду /profile, чтобы посмотреть, как выглядит твой профиль.

Как только готов к поиску, просто измени статус🧙‍♂️"""
see_you_in_week = f"Хорошо, тогда увидимся через неделю :) Но если тебе захочется найти собеседника, ты легко можешь изменить свой статус в профиле  с помощью команды /profile До встречи!"
see_you_on_Sunday='Тогда, надеюсь, увидимся в воскресенье, когда мы начинаем неделю новых встреч. Мы напишем тебе📬'
thank_you_for_feedback_see_you_on_Sunday= "Спасибо, мы записали твою оценку. До встречи в воскресенье!💫"
your_profile_is_empty = """Спасибо за твою оценку🥰

...Ах да, чуть не забыли сказать, мы заметили, что твой профиль почему-то пустует📝

Укажи в нем свои интересы, тогда BeNearly сможет подобрать тебе пару."""
want_find_another_companion = """⭐️Отлично! 

Хочешь, мы начнем искать тебе нового собеседника?🧙‍♂️"""
write_your_email = """Первым делом, напиши свою почту для регистрации⏬"""










"""Menu"""

help_menu = """🔮Здесь мы постараемся ответить на все твои вопросы.

Что бы ты хотел узнать?🔻"""

first_meeting_tips="""💡Подсказки для первой встречи"""
first_meet = """💡Подсказки для первой встречи💡

<b>Что делать когда ты получил собеседника?</b>

👉Не стесняйся написать первым, сделать первый шаг навстречу - красивый и смелый жест.
Начать можно так: 

"Привет👋, бот BeNearly сказал, что ты мой собеседник на этой неделе. Приятно познакомиться."
А дальше попробуйте договориться о времени, когда вам будет удобно пообщаться.

<b>Что делать, если собеседник не отвечает?</b>

👉Можно попробовать напомнить собеседнику о себе.
Например, вот так:

"Привет, что насчет нашей встречи? У тебя получится пообщаться на этой неделе?".

😶Но если он по-прежнему не отвечает, то расскажи нам об этом в среду. 
Мы обязательно подыщем тебе нового собеседника.

<b>И, конечно же, старайся не игнорировать собеседника🙏</b>

Лучше напиши предупреди его сразу, если не получится пообщаться.

<b>А мы готовы ответить в любое время под звездами💫</b>

Просто воспользуйся командой /help и выбери "Задать свой вопрос"."""

how_bot_work_button = """⚙️Как работает бот?"""
how_bot_work ="""☯️Сейчас мы проводим встречи в двух разных форматах: недельные и 10-минутные встречи.

📆Недельные встречи: в начале недели мы подбираем тебе собеседника. В этом формате подбор осуществляется на основе интересов и целей, которые  пользователь указал в личном профиле.

По средам и субботам мы просим собеседников оценить, как прошла встреча. Это нужно для того, чтобы в дальнейшем формировать репутацию пользователей, что позволит тебе избегать неадекватных собеседников.🤹‍♂️

⏳10-минутные встречи:
Не раздумывая и не отвлекаясь на предрассудки,  случайных собеседников  просто подбрасывает  прямо в море - бух.

 Во время встречи  ты останешься наедине с собеседником в тайном чате,  у тебя будет возможность обменятся контактами, если  собеседник тебя зацепил, или  в любой момент покинуть встречу, не дожидаясь  окончания 10 минут.🎬"""

ask_your_question="""🙋‍♀️Задать свой вопрос🙋‍♂️"""
write_your_question = """⬇️⬇️⬇️Вводи свой вопрос прям сюда⬇️⬇️⬇️"""