"""Meeting status"""
waiting_status_constant = "waiting"
meeting_status_constant = "meeting"
not_ready_status_constant = "not ready"

"""Text button"""
change_profile = 'изменить профиль'
change_meeting_status = 'изменить статус поиска'

"""Text message"""
share_your_interests = f'Теперь поделись своими интересами. Таким образом вы сможете лучше узнать друг о друге еще до встречи. Совпадающие интересы помогут быстро найти общие темы для общения. Но и различные интересы  часто дарят  множество  открытий для собеседников. Не волнуйся, ты всегда можешь изменить данные в своем профиле с помощью команды /profile'
see_you_in_week = f"Хорошо, тогда увидимся через неделю :) Но если тебе захочется найти собеседника, ты легко можешь изменить свой статус в профиле  с помощью команды /profile До встречи!"
find_companion_on_Monday = f"Мы постараемся найти тебе собеседника в понедельник. До встречи!👀"
error_contact_support = f"Возникла ошибка, обратись в поддержку"
want_find_another_companion = "Отлично! Хочешь, мы начнем искать тебе нового собеседника?🌛"
see_you_on_Sunday="Спасибо, мы записали твою оценку. До встречи в воскресенье!💫"
